ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C2000/f280015x_output_xbar_regs.xml
	<register id="OUTPUT3MUX0TO15CFG" width="32" page="1" offset="0x8" internal="0" description="Output X-BAR Mux Configuration for Output 3">
		<bitfield id="MUX0" description="Mux0 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX1" description="Mux1 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX2" description="Mux2 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX3" description="Mux3 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX4" description="Mux4 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX5" description="Mux5 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX6" description="Mux6 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX7" description="Mux7 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX8" description="Mux8 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX9" description="Mux9 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX10" description="Mux10 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX11" description="Mux11 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX12" description="Mux12 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX13" description="Mux13 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX14" description="Mux14 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX15" description="Mux15 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="OUTPUT3MUX16TO31CFG" width="32" page="1" offset="0xa" internal="0" description="Output X-BAR Mux Configuration for Output 3">
		<bitfield id="MUX16" description="Mux16 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX17" description="Mux17 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX18" description="Mux18 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX19" description="Mux19 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX20" description="Mux20 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX21" description="Mux21 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX22" description="Mux22 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX23" description="Mux23 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX24" description="Mux24 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX25" description="Mux25 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX26" description="Mux26 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX27" description="Mux27 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX28" description="Mux28 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX29" description="Mux29 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX30" description="Mux30 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX31" description="Mux31 Configuration for OUTPUT3 of OUTPUT-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="OUTPUT4MUX0TO15CFG" width="32" page="1" offset="0xc" internal="0" description="Output X-BAR Mux Configuration for Output 4">
		<bitfield id="MUX0" description="Mux0 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX1" description="Mux1 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX2" description="Mux2 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX3" description="Mux3 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX4" description="Mux4 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX5" description="Mux5 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX6" description="Mux6 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX7" description="Mux7 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX8" description="Mux8 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX9" description="Mux9 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX10" description="Mux10 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX11" description="Mux11 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX12" description="Mux12 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX13" description="Mux13 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX14" description="Mux14 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX15" description="Mux15 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="OUTPUT4MUX16TO31CFG" width="32" page="1" offset="0xe" internal="0" description="Output X-BAR Mux Configuration for Output 4">
		<bitfield id="MUX16" description="Mux16 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX17" description="Mux17 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX18" description="Mux18 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX19" description="Mux19 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX20" description="Mux20 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX21" description="Mux21 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX22" description="Mux22 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX23" description="Mux23 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX24" description="Mux24 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX25" description="Mux25 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX26" description="Mux26 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX27" description="Mux27 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX28" description="Mux28 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX29" description="Mux29 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX30" description="Mux30 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX31" description="Mux31 Configuration for OUTPUT4 of OUTPUT-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="OUTPUT5MUX0TO15CFG" width="32" page="1" offset="0x10" internal="0" description="Output X-BAR Mux Configuration for Output 5">
		<bitfield id="MUX0" description="Mux0 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX1" description="Mux1 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX2" description="Mux2 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX3" description="Mux3 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX4" description="Mux4 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX5" description="Mux5 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX6" description="Mux6 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX7" description="Mux7 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX8" description="Mux8 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX9" description="Mux9 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX10" description="Mux10 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX11" description="Mux11 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX12" description="Mux12 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX13" description="Mux13 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX14" description="Mux14 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX15" description="Mux15 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="OUTPUT5MUX16TO31CFG" width="32" page="1" offset="0x12" internal="0" description="Output X-BAR Mux Configuration for Output 5">
		<bitfield id="MUX16" description="Mux16 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX17" description="Mux17 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX18" description="Mux18 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX19" description="Mux19 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX20" description="Mux20 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX21" description="Mux21 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX22" description="Mux22 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX23" description="Mux23 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX24" description="Mux24 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX25" description="Mux25 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX26" description="Mux26 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX27" description="Mux27 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX28" description="Mux28 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX29" description="Mux29 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX30" description="Mux30 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX31" description="Mux31 Configuration for OUTPUT5 of OUTPUT-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="OUTPUT6MUX0TO15CFG" width="32" page="1" offset="0x14" internal="0" description="Output X-BAR Mux Configuration for Output 6">
		<bitfield id="MUX0" description="Mux0 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX1" description="Mux1 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX2" description="Mux2 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX3" description="Mux3 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX4" description="Mux4 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX5" description="Mux5 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX6" description="Mux6 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX7" description="Mux7 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX8" description="Mux8 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX9" description="Mux9 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX10" description="Mux10 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX11" description="Mux11 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX12" description="Mux12 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX13" description="Mux13 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX14" description="Mux14 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX15" description="Mux15 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="OUTPUT6MUX16TO31CFG" width="32" page="1" offset="0x16" internal="0" description="Output X-BAR Mux Configuration for Output 6">
		<bitfield id="MUX16" description="Mux16 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX17" description="Mux17 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX18" description="Mux18 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX19" description="Mux19 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX20" description="Mux20 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX21" description="Mux21 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX22" description="Mux22 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX23" description="Mux23 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX24" description="Mux24 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX25" description="Mux25 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX26" description="Mux26 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX27" description="Mux27 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX28" description="Mux28 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX29" description="Mux29 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX30" description="Mux30 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX31" description="Mux31 Configuration for OUTPUT6 of OUTPUT-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
