ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C2000/f280015x_output_xbar_regs.xml
	<register id="OUTPUTLATCH" width="32" page="1" offset="0x30" internal="0" description="Output X-BAR Output Latch ">
		<bitfield id="OUTPUT1" description="Records the OUTPUT1 of OUTPUT-XBAR" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="OUTPUT2" description="Records the OUTPUT2 of OUTPUT-XBAR" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="OUTPUT3" description="Records the OUTPUT3 of OUTPUT-XBAR" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="OUTPUT4" description="Records the OUTPUT4 of OUTPUT-XBAR" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="OUTPUT5" description="Records the OUTPUT5 of OUTPUT-XBAR" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="OUTPUT6" description="Records the OUTPUT6 of OUTPUT-XBAR" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="OUTPUT7" description="Records the OUTPUT7 of OUTPUT-XBAR" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="OUTPUT8" description="Records the OUTPUT8 of OUTPUT-XBAR" begin="7" end="7" width="1" rwaccess="R"/>
	</register>
	<register id="OUTPUTLATCHCLR" width="32" page="1" offset="0x32" internal="0" description="Output X-BAR Output Latch Clear ">
		<bitfield id="OUTPUT1" description="Clears the Output-Latch for OUTPUT1 of OUTPUT-XBAR" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT2" description="Clears the Output-Latch for OUTPUT2 of OUTPUT-XBAR" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT3" description="Clears the Output-Latch for OUTPUT3 of OUTPUT-XBAR" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT4" description="Clears the Output-Latch for OUTPUT4 of OUTPUT-XBAR" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT5" description="Clears the Output-Latch for OUTPUT5 of OUTPUT-XBAR" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT6" description="Clears the Output-Latch for OUTPUT6 of OUTPUT-XBAR" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT7" description="Clears the Output-Latch for OUTPUT7 of OUTPUT-XBAR" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT8" description="Clears the Output-Latch for OUTPUT8 of OUTPUT-XBAR" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="OUTPUTLATCHFRC" width="32" page="1" offset="0x34" internal="0" description="Output X-BAR Output Latch Clear ">
		<bitfield id="OUTPUT1" description="Sets the Output-Latch for OUTPUT1 of OUTPUT-XBAR" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT2" description="Sets the Output-Latch for OUTPUT2 of OUTPUT-XBAR" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT3" description="Sets the Output-Latch for OUTPUT3 of OUTPUT-XBAR" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT4" description="Sets the Output-Latch for OUTPUT4 of OUTPUT-XBAR" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT5" description="Sets the Output-Latch for OUTPUT5 of OUTPUT-XBAR" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT6" description="Sets the Output-Latch for OUTPUT6 of OUTPUT-XBAR" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT7" description="Sets the Output-Latch for OUTPUT7 of OUTPUT-XBAR" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT8" description="Sets the Output-Latch for OUTPUT8 of OUTPUT-XBAR" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="OUTPUTLATCHENABLE" width="32" page="1" offset="0x36" internal="0" description="Output X-BAR Output Latch Enable ">
		<bitfield id="OUTPUT1" description="Selects the output latch to drive OUTPUT1 for OUTPUT-XBAR" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT2" description="Selects the output latch to drive OUTPUT2 for OUTPUT-XBAR" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT3" description="Selects the output latch to drive OUTPUT3 for OUTPUT-XBAR" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT4" description="Selects the output latch to drive OUTPUT4 for OUTPUT-XBAR" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT5" description="Selects the output latch to drive OUTPUT5 for OUTPUT-XBAR" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT6" description="Selects the output latch to drive OUTPUT6 for OUTPUT-XBAR" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT7" description="Selects the output latch to drive OUTPUT7 for OUTPUT-XBAR" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT8" description="Selects the output latch to drive OUTPUT8 for OUTPUT-XBAR" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="OUTPUTINV" width="32" page="1" offset="0x38" internal="0" description="Output X-BAR Output Inversion ">
		<bitfield id="OUTPUT1" description="Selects polarity for OUTPUT1 of OUTPUT-XBAR" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT2" description="Selects polarity for OUTPUT2 of OUTPUT-XBAR" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT3" description="Selects polarity for OUTPUT3 of OUTPUT-XBAR" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT4" description="Selects polarity for OUTPUT4 of OUTPUT-XBAR" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT5" description="Selects polarity for OUTPUT5 of OUTPUT-XBAR" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT6" description="Selects polarity for OUTPUT6 of OUTPUT-XBAR" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT7" description="Selects polarity for OUTPUT7 of OUTPUT-XBAR" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT8" description="Selects polarity for OUTPUT8 of OUTPUT-XBAR" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="OUTPUTLOCK" width="32" page="1" offset="0x3e" internal="0" description="Output X-BAR Configuration Lock register">
		<bitfield id="LOCK" description="Locks the configuration for OUTPUT-XBAR" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Write Protection KEY" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
</module>
